# The game

import random
print('Игра виселица, версия 1.0')

# constants
HANGMAN = (
"""
 ------
 |    |
 |
 |
 |
 |
 |
 |
 |
_________
""",
"""
 ------
 |    |
 |    O
 |
 |
 |
 |
 |
 |
_________
""",
"""
 ------
 |    |
 |    O
 |    |
 |
 |
 |
 |
 |
_________
""",
"""
 ------
 |    |
 |    O
 |    |
 |  /-+-\\
 |
 |
 |
 |
_________
""",
"""
 ------
 |    |
 |    O
 |    |
 |  /-+-\\
 |    |
 |
 |
 |
_________
""",
"""
 ------
 |    |
 |    O
 |    |
 |  /-+-\\
 |    |
 |    |
 |
 |
_________
""",
"""
 ------
 |    |
 |    O
 |    |
 |  /-+-\\
 |    |
 |    |
 |   |
 |   |
_________
""",
"""
 ------
 |    |
 |    O
 |    |
 |  /-+-\\
 |    |
 |    |
 |   | |
 |   | |
_________
""")

MAX_WRONG = len(HANGMAN) - 1

secret = ('python', 'hello', 'dima')

i = 0
while i <= MAX_WRONG:
	result = input('Введите букву: ')
	if not result in secret:
		print('нет такой буквы')
		print(HANGMAN[i])
		i += 1
	else:
		print('вы отгадали')
	if result == '0':
		break
print('игра окончена')
